tips-for-msc-students.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-11-24 Thu 10:58 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Tips for MSc students</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Martin R. Albrecht" />
<link rel="stylesheet" href="css/worg.css" type="text/css" media="screen" />
<link rel="stylesheet" type="text/css" href="css/bundle.css"/>
<link rel="stylesheet" type="text/css" href="css/custom.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Tips for MSc students</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">Commitment</a></li>
<li><a href="#orgheadline2">Intellectual rigour</a></li>
<li><a href="#orgheadline3">Organisation</a></li>
<li><a href="#orgheadline4">Creativity</a></li>
<li><a href="#orgheadline5">Marketing speak</a></li>
<li><a href="#orgheadline6">Literature</a></li>
<li><a href="#orgheadline7">Questions</a></li>
<li><a href="#orgheadline8">Feedback on drafts</a></li>
<li><a href="#orgheadline9">Writing</a></li>
<li><a href="#orgheadline10">Flexibility</a></li>
<li><a href="#orgheadline11">Tools</a></li>
<li><a href="#orgheadline12">Coding</a></li>
<li><a href="#orgheadline13">Formalities</a></li>
</ul>
</div>
</div>
<p>
If you are a student doing or considering doing an MSc project with me, keep reading, this document will hopefully provide some useful guidance.
</p>

<p>
Given my area of expertise (computer science with a focus towards cryptography), most MSc projects I supervise will be somewhat technical in nature. Hence, the following guidance is written with a view towards that area.
</p>

<p>
However, I am happy to discuss/consider supervising MSc projects in other areas of information security as well. In this case not all advise below would apply. If you are unsure, come talk to me.
</p>

<p>
<b>Note:</b> Large parts of this document is shamelessly stolen from <a href="https://github.com/veorq/misc/blob/students/STUDENTS.md">JP Aumasson</a>.
</p>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">Commitment</h2>
<div class="outline-text-2" id="text-orgheadline1">
<p>
In order to successfully deliver a good MSc project it quite important to work on something you are interested in and something you care about. 
</p>

<p>
If you’re not enjoying working on the project at all this is not a good sign and you should probably come and talk to me. If you feel unsatisfied with the work you're doing or if you'd prefer to do something a bit different, we can discuss if it is possible to adapt the project to a topic that is better for you, in terms of learning, efficiency or career.
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2">Intellectual rigour</h2>
<div class="outline-text-2" id="text-orgheadline2">
<p>
You will need to bring rigour and an analytical mindset. For example, you should be able to define the problem precisely, to determine what information you need to solve that problem and whether you have data or a theorem at your disposal that carries that information.
</p>

<p>
If you make a claim not supported by any data or theorem, you should be able to define the premises upon which your claim stands. Also, you should be able to detect bogus reasoning and fallacious claims.
</p>

<p>
When data is available, use it to make precise fact-based claims, rather than mere qualitative assessments or guesses. For example, instead of saying “this method is faster” you would say “this method is 2.6 times faster than the generic one on CPU model X”, or “this method runs at 123 GBps” — measure, don't speculate. Similarly, when you state that this or that construction is cryptographically secure, state precisely which security goals it meets under which hardness assumptions. Finally, make your results and measurements reproducible.
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3">Organisation</h2>
<div class="outline-text-2" id="text-orgheadline3">
<p>
I strongly recommend that you maintain a todo list and notes in order to keep track of tasks and to prioritise them. I also recommend creating a rough project timeline against which you can measure your progress as you get on with the project. This way you can detect when things go off the rails. There are plenty of software options available to help you with that. Some people like <a href="https://trello.com/">Trello</a>, some people like <a href="https://www.toodledo.com/">Toodledo</a>, some people swear on <a href="https://evernote.com/">Evernote</a> or <a href="https://www.onenote.com/">OneNote</a>. I personally use <a href="http://orgmode.org/">Org-mode</a>.
</p>

<p>
You should also organise your literature notes and your references in general in some systematic way. Some people like <a href="https://www.zotero.org/">Zotero</a>, some like <a href="https://www.mendeley.com/">Mendeley</a> to help them with that. I use <a href="https://github.com/tmalsburg/helm-bibtex">Helm-BibTeX</a>.
</p>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4">Creativity</h2>
<div class="outline-text-2" id="text-orgheadline4">
<p>
Your project might include a research component. This means that you're not here just to execute tasks, but also to bring your own ideas regarding the direction and execution of the project. Creativity means, for example, finding different ways to solve a technical problem or adapting the goals of the project to more interesting/ambitious/original ones. Creativity is also about challenging my ideas and, even better, proving me wrong.
</p>

<p>
“But I'm not a creative person!”; creativity is not a skill or a character trait, it's a mode of operation. It takes curiosity and stubbornness.
</p>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5">Marketing speak</h2>
<div class="outline-text-2" id="text-orgheadline5">
<p>
If you are doing a <b>technical</b> project with me, do not spend the first 20 pages with marketing speak and quoting Gartner reports on business projections. For example, when investigating the security of some software for remote file storage, do not start with an extensive account on “why private, public or hybrid clouds are excellent for businesses”. It is important to motivate a technical question but keep it brief.
</p>

<p>
Similarly, equip yourself with a good detector for bad science. You'll need it if you work in information security! In information security, some signs are:
</p>

<ul class="org-ul">
<li>The abuse of the word “cyber”.</li>
<li>The use of superlatives instead of reliable facts. For example, “our ultra-advanced cyber detection system performs extraordinarily to reach a 200 threats.“</li>
<li>Incorrect use of technical terms, for example, confusion between “vulnerability”, “exploit" and “malware” or “cipher” and “cryptographic protocol”.</li>
<li>The use and abuse of buzzwords, especially when simpler terms would fit. For example, “secure blockchain-based deep learning”. New buzzwords appear regularly.</li>
<li>Forcing the blockchain on everything.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6">Literature</h2>
<div class="outline-text-2" id="text-orgheadline6">
<p>
Random websites, press clippings and typically whitepapers are not reliable sources of information. Some technical whitepapers contain useful information, but often they are just glorified ads. 
</p>

<p>
You will have to engage with the academic literature. But not all literature is of equal quality, you’ll need to develop a sense of what is good research and what is not. I suggest the following exercise:
</p>

<ol class="org-ol">
<li>Find 3 academic papers (preferably published, but in this fast moving field often pre-prints will have to do) on your topic.</li>
<li>Describe what each does in 3 sentences each max.</li>
<li>Rank these three papers from great to perhaps-not-so-great or worse. Explain why in 1-2 sentences.</li>
<li>Find the three top venues (conferences, journals) where papers on this area would be published.</li>
</ol>

<p>
This would give you (and me) some idea how hard a time you’d have engaging with the subject in the manner the MSc project would require: finding scientific work and critically evaluating it.
</p>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7">Questions</h2>
<div class="outline-text-2" id="text-orgheadline7">
<p>
Before asking me a question (such as “how to get command-line arguments in C?”), try to find the answer by yourself first in the usual places (literature, Google, StackOverflow, etc.). I can suggest some strategies for how to find good answers.
</p>

<p>
I will try to respond to your requests or questions by email fairly quickly. You can also come by my office hour (Thursday, 2pm) but I prefer a written form because it forces you to write down the question and thus think about it. A written response also leaves a trace for further reference (“but <b>you</b> told me that, look!“).
</p>

<p>
Similarly, the more specific your question the better are your chances of getting a good response. For example “Can we have a meeting about my project?” gives me no clue if and what I should prepare, how much time to schedule or if the issue at hand could be handled much more efficiently in writing via e-mail.
</p>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-2">
<h2 id="orgheadline8">Feedback on drafts</h2>
<div class="outline-text-2" id="text-orgheadline8">
<p>
I’m happy to give you feedback on an early draft up until 4 weeks before the submission deadline. Before and after that deadline, I’m happy to answer specific questions.
</p>

<p>
I cannot give detailed feedback on grammar or spelling, but I will point out if I believe you should improve.
</p>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-2">
<h2 id="orgheadline9">Writing</h2>
<div class="outline-text-2" id="text-orgheadline9">
<p>
To learn the basics of good writing, JP Aumasson recommends <a href="http://www.crockford.com/wrrrld/style.html">The Elements of Style</a>. It's a quick and easy read. To further improve your English, he also recommends you check William Zinsser's <a href="https://www.amazon.com/Writing-Well-Classic-Guide-Nonfiction/dp/0060891548/">On Writing Well</a>, another classic. You'll find a PDF <a href="http://www.brynmawr.edu/math/people/anmyers/ESem/on-writing-well.pdf">online</a>.
</p>

<p>
Royal Holloway has a <a href="https://www.royalholloway.ac.uk/ecampus/cedas/home.aspx">Centre for the Development of Academic Skills</a> which offers courses on improving Academic English writing. It also offers a service to connect you to a professional, approved proofreader. They will require a letter from me for the latter, I’m happy to provide it.
</p>

<p>
You may also have some success with automated tools such as <a href="https://app.grammarly.com/">Grammarly</a> or <a href="https://www.languagetool.org/">LanguageTool</a>, the latter is available as a plugin for Emacs, Sublime Text and LibreOffice.
</p>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-2">
<h2 id="orgheadline10">Flexibility</h2>
<div class="outline-text-2" id="text-orgheadline10">
<p>
You may receive emails from me at night or during weekends, but that does not mean that I expect you to also work at those times.
</p>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-2">
<h2 id="orgheadline11">Tools</h2>
<div class="outline-text-2" id="text-orgheadline11">
<p>
Feel free to use and propose other tools than the ones I propose. I neither care if you use emacs, vi, Sublime Text or MS Word nor which programming language, framework or libraries you use.
</p>

<p>
I highly recommend that you use revision control such as to organise and backup your project. I’ve written about using Git for academic writing on <a href="https://martinralbrecht.wordpress.com/2016/01/10/writing-crypto-papers-and-version-control/">my blog</a>.
</p>
</div>
</div>

<div id="outline-container-orgheadline12" class="outline-2">
<h2 id="orgheadline12">Coding</h2>
<div class="outline-text-2" id="text-orgheadline12">
<p>
If you write code, it should not only work/compile, it should also follow the best practices and coding conventions for the specific language you're using. You should assume that your code will be published and be visible to your peers and future potential employers.
</p>

<p>
For example, don’t code a dirty or unsafe workaround thinking “that's ok since nobody will read the code”. If you have to use such code, add a comment highlighting it and justifying it.
</p>

<p>
To write code of better quality, use static code analysers and code formatters. For example, <code>pylint</code> and <code>pep8</code> for Python, gofmt for Go, and for C(++), <code>valgrind</code>, <code>flawfinder</code>, <code>clang-format</code>, clang's address sanitizer, to name but a few.
</p>
</div>
</div>

<div id="outline-container-orgheadline13" class="outline-2">
<h2 id="orgheadline13">Formalities</h2>
<div class="outline-text-2" id="text-orgheadline13">
<p>
The most straight-forward way to address me is just to use my first name, no “Mr.”, “Dr.” required. This is the general etiquette at Royal Holloway and British universities in general. Hence, I tend to address everybody by their first name as well. If that doesn’t work for you, let me know.
</p>
</div>
</div>
</div>
</body>
</html>
